In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
df = pd.DataFrame(
    np.arange(12).reshape(3,4),
    columns=["A", "B", "C", "D"]
)
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [4]:
np.arange(12).reshape(2, 6)

array([[ 0,  1,  2,  3,  4,  5],
       [ 6,  7,  8,  9, 10, 11]])

In [5]:
df.drop("A",axis=1)

   B   C   D
0  1   2   3
1  5   6   7
2  9  10  11

In [6]:
df.drop(1, axis=0)

   A  B   C   D
0  0  1   2   3
2  8  9  10  11

In [7]:
df

   A  B   C   D
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [8]:
df.mean(axis=0)

A    4.0
B    5.0
C    6.0
D    7.0
dtype: float64

In [9]:
df.mean(axis=1)

0    1.5
1    5.5
2    9.5
dtype: float64

In [11]:
def get_sum_value(x):
    return x["A"] + x["B"] + x["C"] + x["D"]
df["sum_value"] = df.apply(get_sum_value, axis=1)

In [12]:
df

   A  B   C   D  sum_value
0  0  1   2   3          6
1  4  5   6   7         22
2  8  9  10  11         38